/************************************************************
Copyright (C) 深圳英可瑞科技开发有限公司
文 件 名：CanComm.h
版    本：1.00
创建日期：2012-08-08
作    者：郭数理
功能描述：馈线模块的通信及数据处理任务头文件


修改记录：
	作者      日期        版本     修改内容
	郭数理    2012-08-08  1.00     创建
**************************************************************/


#ifndef __CAN_COMM_H_
#define __CAN_COMM_H_



/*************************************************************
函数名称: v_can_module_can_comm_task
函数功能: 下级模块通信及数据处理任务函数
输入参数: 无
输出参数: 无
返回值  ：无
**************************************************************/
__task void v_can_module_can_comm_task(void);


#endif
