/************************************************************
Copyright (C) 深圳英可瑞科技开发有限公司
文 件 名：WdtTask.h
版    本：1.00
创建日期：2012-06-05
作    者：郭数理
功能描述：看门狗任务头文件


修改记录：
	作者      日期        版本     修改内容
	郭数理    2012-06-05  1.00     创建
**************************************************************/

#ifndef __WDT_TASK_H_
#define __WDT_TASK_H_


/*************************************************************
函数名称: v_wtask_wdt_task		           				
函数功能: 看门狗任务函数						
输入参数: 无        		   				
输出参数: 无
返回值  ：无														   				
**************************************************************/
__task void v_wtask_wdt_task(void);


#endif
